:main
@echo 帖子名称：关于校庆并之前一些活动的吐槽
@echo 帖子链接：http://tieba.baidu.com/p/6319225691
@echo 帖子创建日期：2019年10月31日
@echo 存在状况：已经被吧主/小吧主删除。
@echo -----------------------------------------------------------
@echo 请选择使用：
@echo 
@echo  1.浏览该贴（即在下面输入1）
@echo 
@echo  2.关闭（即在下面输入2）
@echo -----------------------------------------------------------
set /p choice=请输入数字并按回车键确认:

@echo
if %choice%==1 goto Read
if %choice%==2 goto End
cls
"set choice="
echo 您输入有误，请重新选择。
ping 127.0.1 -n "2">nul
goto main

:Read
@echo 哎，学业繁忙，最近才有时间上贴吧。
@echo “在贴吧上有人不惜以最...”宋校长停顿了三秒钟，明显没想出下一个词应该用什么，"黑暗的想法啊，来揣摩我们的每一次活动。"
@echo ——大概是这样，时间太久了，意思符合原意但是具体语句可能有误。
@echo 我的想法是：“这不废话吗，你要是搞个活动——让学生都挺开心的，我们至于揣摩你吗？”
@echo 
@echo 
@echo 1.去年的芳华
@echo 半夜搞活动，占用休息时间，不利于学生休息。
@echo ——这已经足够我反对这个活动了，因为这直接影响到学习。
@echo 要是选择一个下午或者上午搞这个活动：
@echo 影响准备节目的同学，他们乐意准备节目那是他们自己的事情，我认为对这些同学的影响没什么好批评的。
@echo 而对于其他同学而言，也只耽误一个下午。你这影响休息，打乱作息时间...明天一天你还上什么课啊？
@echo 
@echo 
@echo 2.五月底的红歌合唱
@echo 占用月考复习时间，相当于是影响学生考试，不利于学生对自己成绩有一个客观而准确的判断。
@echo ——这已经足够我反对这个活动了，因为这直接影响到学习。
@echo 学生失掉了一次客观判断自己成绩的机会，他们没有机会借助这次考试搜出自己"就算复习了也掌握不牢的知识点"。
@echo 另一方面，长达一周的准备时间和对合唱质量的严格要求——甚至有的班都要买新衣服用于活动时穿——非常影响学习。
@echo 学生应当以学习为主，约莫宋校长不知道这一点。
@echo ——他也不知道熵是怎么一回事。因为学物理的人一定要选修数学，而学数学的人懂逻辑，知道"应该给学生好好学习的环境"是大前提、是"这个学校是个好学校"的必要条件。
@echo 
@echo 
@echo 3.十月十日
@echo 对于学业繁忙的高三学生而言，我比较喜欢这个活动的地方是：
@echo 连续一周没有晚自习、难得的双休日和精美的红色笔记本。
@echo 哦，还有那个语文作文讲座，真的很有作用（不过其他年级的学生大概是没机会听这个讲座的）。
@echo 从大局观考虑，这个活动总体来讲完全没有考虑到学生的想法——
@echo 出现问题的地方(时间顺序)：
@echo 
@echo 
@echo 1.
@echo 活动准备之前占用课间操时间练习唱歌，占用班会时间练习唱歌。影响学生体育活动。这算小事。
@echo 在这段时间里，石主任(我忘了是哪个"石"了)还专门抓了几个学生出操速度不快。哎...
@echo 
@echo 
@echo 那么现在问题来了：被抓住的那些学生不想快吗?
@echo 石主任在"音乐一停止"时立刻就到楼门堵住了他们。
@echo 那些学生是被前面走路的学生挡住了才没办法按时出楼门的。
@echo ——石主任抓住的学生十有八九是无辜的。
@echo 他们之所以没法按时，全都是"前面的学生的问题"和"学校定的时间太短的问题"，跟他们自身一点关系没有。
@echo 看着一位班主任拄着拐杖拖着伤腿一瘸一拐地走到前面去领学生去，我觉得很难受，我觉得看到这一幕的其他人也觉得很难受（宋校长除外，宋校长的想法我搞不清楚）。
@echo 
@echo 
@echo 2.
@echo 在操场拍摄什么片子，占用体育课空间。
@echo 
@echo 
@echo 3.
@echo 活动前在操场那里演习。
@echo 印象深刻啊，上着课呢，老师吼着我们也没怎么听见老师讲话——外面太吵了。
@echo 影响上课时间，影响听课效率。特别是身为高三学生的我们，一寸光阴一寸金啊！
@echo 这么宝贵的课，老师带着我们复习的话、也就高三第一轮复习能讲这么细致....
@echo 然而校领导竟然给我们高三安排一个乱糟糟的环境！
@echo 真是使十中学子，不敢言而敢怒。——这不全跑贴吧来了。
@echo 
@echo 
@echo 4.
@echo 活动期间
@echo 除了那个老校长值得敬佩之外，真的很糟糕
@echo ——糟糕的表演
@echo ——糟糕的视频
@echo ——又臭又长的"什么工作报告"
@echo 
@echo 
@echo 这些内容基本全都不是给学生看的。
@echo 把全校同学放到操场上闲坐一个上午，吾未见其明也。
@echo 
@echo 
@echo 5.
@echo 活动结束后
@echo 宋校长的结尾演讲实在是振奋人心，我隔了这么久还能复述其中的一部分呢。
@echo 这里节选几个中心观点评论：
@echo A.经费不足，校舍已经年久，需要修缮的地方很多。
@echo 那你为什么搞这么多活动，好好修修校舍不好吗？
@echo B.学生揣测充满恶意。
@echo 那你为什么搞这种活动，搞个学生喜欢的活动不好吗？
@echo C.老校长在那里讲话，我实在是...(这里的表达并不明确，但大概意思大家都懂)。
@echo 没错，老校长确实值得敬佩，没问题，不影响我们恶意揣测。
@echo (然而我现在还足够理智，没有从思想上去揣测，只是陈述客观事实)
@echo D.我觉得应该有一点群体荣誉感。
@echo 一个使学子，不敢言而敢怒的学校，你指望荣誉感？
@echo 大量活动，有个词叫做"劳民伤财"，我改改，这就是"劳学生伤教师"。
@echo 
@echo 
@echo 
@echo 
@echo 我不反对活动，我反对的是对学习有很大影响的活动。我不恶意揣测，我照样可以逐一反驳宋主任您的观点。
@echo @政教处宋老师 您改悔罢！
pause
goto End

:End
pause
